class ModelConfig:
    """模型参数配置
    """

    # 日钢标载
    RG_DEFAULT_CITY = '临沂市'
    RG_CONSUMER_WEIGHT = 200000
    RG_EARLY_MAX_WEIGHT = 40400
    RG_MAX_WEIGHT = 35000
    RG_MIN_WEIGHT = 31000
    RG_TO_BZ_MAX_WEIGHT = 39000
    RG_J_MIN_WEIGHT = 29000
    RG_J_PIECE_MIN_WEIGHT = 26000
    RG_SECOND_MIN_WEIGHT = 24000
    RG_SINGLE_UP_WEIGHT = 400
    RG_SINGLE_LOWER_WEIGHT = 2000
    RG_COMMODITY_WEIGHT = {'老区-卷板': RG_J_MIN_WEIGHT,
                           '新产品-卷板': RG_J_MIN_WEIGHT,
                           '新产品-白卷': RG_J_MIN_WEIGHT,
                           '老区-型钢': RG_MIN_WEIGHT,
                           '老区-线材': RG_MIN_WEIGHT,
                           '老区-螺纹': RG_MIN_WEIGHT,
                           '老区-开平板': RG_MIN_WEIGHT,
                           '新产品-窄带': RG_MIN_WEIGHT,
                           '新产品-冷板': RG_MIN_WEIGHT
                           }
    RG_J_GROUP = ['老区-卷板', '新产品-卷板', '新产品-白卷']
    RG_BZ_GROUP = ['老区-卷板', '新产品-卷板', '新产品-白卷', '老区-型钢', '老区-线材', '老区-螺纹', '老区-开平板']
    RG_PRIORITY = {'客户催货一级': 1, '客户催货二级': 2, '超期清理': 3}
    RG_PRIORITY_GRADE = {1: "A", 2: "B", 3: "C", 4: "D"}
    RG_LY_GROUP = {
        '赣榆区': ['U220-赣榆库', '赣榆区'],
        '黄岛区': ['U210-董家口库', '黄岛区'],
        '淮阴区': ['U288-岚北港口库2', '淮阴区'],
        '灌云县': ['U288-岚北港口库2LYG', '灌云县'],
        '连云区': ['U123-连云港东泰码头(外库)', 'U124-连云港东联码头(外库)', '连云区']
    }
    RG_NB_PACK = [  # 窄带的包装形式
        ['FJC71', 'GJC71', 'HLC02', 'PJC71'],  # 木托
        ['CJC77', 'FJC77', 'FJC76', 'HLC01', 'HLC03', 'GJC76', 'PJC77', 'PJC76']  # 窄带卷
    ]
    # 相同客户配置
    CONSUMER_DICT = {
        '山东省博兴县拓鑫钢铁贸易有限公司': '山东鹏禾新材料有限公司'
    }
    # 可跨区县拼货配置：键为优先级，值为可跨区县拼货的区县（要求已经按照优先级从高到低排好序）
    ACROSS_DISTRICT_DICT = {
        '1': ['天桥区', '历城区'],
        '2': ['天桥区', '槐荫区'],
        '3': ['天桥区', '市中区'],
        '4': ['历城区', '槐荫区'],
        '5': ['槐荫区', '市中区']
    }
    RG_COMMODITY_GROUP = {'老区-型钢': ['老区-型钢'],
                          '老区-线材': ['老区-线材'],
                          '老区-螺纹': ['老区-螺纹'],
                          '老区-开平板': ['老区-开平板'],
                          '老区-卷板': ['新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-白卷': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-卷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '老区-卷板', '新产品-卷板'],
                          '新产品-窄带': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板'],
                          '新产品-冷板': ['新产品-窄带', '新产品-冷板', '新产品-白卷', '新产品-卷板']
                          }
    # 摘单备注时的简写品种
    PICK_REMARK = {'老区-型钢': '型钢',
                   '老区-线材': '线材',
                   '老区-螺纹': '螺纹',
                   '老区-开平板': '开平板',
                   '老区-卷板': '黑卷',
                   '新产品-白卷': '白卷',
                   '新产品-白卷(热镀锌)': '白卷(热镀锌)',
                   '新产品-卷板': '黑卷',
                   '新产品-窄带': '窄带',
                   '新产品-窄带(木托窄带)':'窄带(木托窄带)',
                   '新产品-窄带(窄带卷)':'窄带(窄带卷)',
                   '新产品-冷板': '冷板'}
    RG_COMMODITY_GROUP_FOR_SQL = {'老区-型钢': ['型钢'],
                                  '老区-线材': ['线材'],
                                  '老区-螺纹': ['螺纹'],
                                  '老区-开平板': ['开平板'],
                                  '老区-卷板': ['黑卷', '白卷', '线材'],
                                  '新产品-白卷': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-卷板': ['白卷', '黑卷', '线材', '开平板', '窄带', '冷板'],
                                  '新产品-窄带': ['开平板', '窄带', '冷板', '白卷', '黑卷'],
                                  '新产品-冷板': ['开平板', '窄带', '冷板', '白卷', '黑卷']
                                  }

    RG_VARIETY_VEHICLE = {
        "老区-型钢": ["垫木", "垫皮", "钢丝绳"],
        "老区-线材": ["垫木"],
        "老区-螺纹": ["垫木"],
        "新产品-白卷": ["鞍座", "草垫子", "垫皮", "垫木"],
        "老区-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-卷板": ["鞍座", "草垫子", "垫皮", "垫木"],
        "新产品-窄带": ["钢丝绳", "垫皮", "垫木"],
        "新产品-冷板": ["钢丝绳"],
        "老区-开平板": ["垫木"]
    }
    RG_COMMODITY_LYG = ["老区-卷板", "新产品-卷板", "新产品-白卷"]
    RG_PORT_NAME_END_LYG = ["泰州钢冉码头", "泰州华纳码头",
                            "常州钢材现货交易市场码头", "常州万都码头",
                            "常州新东港码头", "常州武进码头",
                            "无锡国联皋桥码头", "无锡国信码头"]

    RG_WAREHOUSE_GROUP = [
        ["P5", "P6", "P7", "P8"],
        ["B1", "B2", "E1", "E2", "E3", "E4", "F1", "F2", "H1", "T1", "X1", "X2", "Z1", "Z2", "Z4", "Z5", "Z8", "ZA",
         "ZC"],
        ["F10", "F20"]
    ]
    RG_WAREHOUSE_GROUP_LIST = ["P5", "P6", "P7", "P8", "B1", "B2", "E1", "E2", "E3", "E4", "F1", "F2", "H1", "T1", "X1",
                               "X2", "Z1", "Z2", "Z4", "Z5", "Z8", "ZA",
                               "ZC", "F10", "F20"]

    RG_WAREHOUSE_NAME = ["宝华", "厂内", "岚北港", "未知厂区"]
    # 摘单推送司机冷却期时间（小时）
    PICK_PROPELLING_COLD_HOUR = 6
    # 判断司机是否移动，20分钟内移动的最低距离限制（米）
    PICK_PROPELLING_DISTANCE_LIMIT = 1000
    # 各仓库最大车辆容纳数
    WAREHOUSE_WAIT_DICT = {
        'stock_name': ['B2', 'E1', 'E2', 'E3', 'E4', 'F1', 'F10', 'F2', 'F20', 'H1', 'P5', 'P6', 'P7', 'P8', 'T1',
                       'X1', 'X2', 'Z1', 'Z2', 'Z4', 'Z5', 'Z8', 'ZA', 'ZC'],
        'truck_count_std': [15, 10, 10, 10, 10, 10, 25, 30, 25, 15, 25, 25, 10, 15, 15, 15, 15, 15, 20, 15, 15, 15, 15,
                            15]
    }
    # 4个城市区县的编码
    RG_DISTRICT_CODE = {
        '济南市': '3701',
        '淄博市': '3703',
        '滨州市': '3716',
        '菏泽市': '3717'
        # '济南市历下区': '370102', '济南市市中区': '370103', '济南市槐荫区': '370104',
        # '济南市天桥区': '370105', '济南市历城区': '370112', '济南市长清区': '370113',
        # '济南市平阴县': '370124', '济南市济阳县': '370125', '济南市章丘区': '370181',
        # '济南市商河县': '370126',  # 济南市
        # '淄博市淄川区': '370302', '淄博市张店区': '370303', '淄博市博山区': '370304',
        # '淄博市临淄区': '370305', '淄博市周村区': '370306', '淄博市桓台县': '370321',
        # '淄博市高青县': '370322', '淄博市沂源县': '370323',  # 淄博市
        # '滨州市滨城区': '371602', '滨州市沾化区': '371603', '滨州市惠民县': '371621',
        # '滨州市阳信县': '371622', '滨州市无棣县': '371623', '滨州市博兴县': '371625',
        # '滨州市邹平县': '371626',  # 滨州市
        # '菏泽市牡丹区': '371702', '菏泽市定陶区': '371703', '菏泽市曹县': '371721',
        # '菏泽市单县': '371722', '菏泽市成武县': '371723', '菏泽市巨野县': '371724',
        # '菏泽市郓城县': '371725', '菏泽市鄄城县': '371726', '菏泽市东明县': '371728'  # 菏泽市
    }
    # 厂区编码
    RG_WAREHOUSE_CODE = {'宝华': '01', '厂内': '02', '岚北港': '03'}
    # 品种编码
    RG_COMMODITY_CODE = {'老区-型钢': '01',
                         '老区-线材': '02',
                         '老区-螺纹': '03',
                         '老区-开平板': '04',
                         '老区-卷板': '05',
                         '新产品-白卷': '06',
                         '新产品-卷板': '07',
                         '新产品-窄带': '08',
                         '新产品-冷板': '09'}
    # 标准车载最大重量
    STANDARD_MAX_WEIGHT = 33000
    # 背包重量下浮
    PACKAGE_LOWER_WEIGHT = 1000
    # 体积上限系数
    MAX_VOLUME = 1.18
    # 缺省值
    DEFAULT_VOLUME = 0.001
    # 分车次限制重量
    TRUCK_SPLIT_RANGE = 1000
    # 考虑体积的物资代码前缀
    ITEM_ID_DICT = {
        # 焊管
        '112': 22,
        '111': 16,
        '110': 20,
        '109': 34,
        '108': 34,
        '107': 34,
        '106': 34,
        '105': 34,
        # 热镀
        '212': 22,
        '211': 16,
        '210': 20,
        '209': 34,
        '208': 34,
        '207': 34,
        '206': 34,
        '205': 40,
        # QF热镀管
        '712': 22,
        '711': 16,
        '710': 20,
        '709': 34,
        '708': 34,
        '707': 34,
        '706': 34,
        '705': 40,
        # 螺旋焊管
        '501': 100,
        '502': 75,
        '503': 49,
        '504': 25,
        '505': 20,
        '506': 18,
        '507': 12,
        '508': 8,
        '509': 6,
    }

    PICK_LABEL_TYPE = {
        "L1": "运力池",
        "L2": "冷启动",
        "L3": "常运流向",
        "L4": "常运品种",
        "L5": "活跃司机"
    }

    PICK_RG_LAT = {"日钢纬度": 35.1582116300}

    PICK_RG_LON = {"日钢经度": 119.3315992000}

    PICK_RESULT_TYPE = {
        "DEFAULT": 500,
        "DIST10": 10,
        "DIST20": 20,
        "DIST30": 30,
        "DIST40": 40,
        "DIST50": 50
    }

    PICK_CONTINUE_TIME = {
        "MINUTE10": 10,
        "MINUTE15": 15,
        "MINUTE20": 20,
        "MINUTE25": 25,
        "MINUTE30": 30
    }
    PICK_TOTAL_WEIGHT = 40
